In [1]:
s1=["Delhi","Chennai","Hyd","Delhi","Mumbai","Chennai","Hyd"]
s2=[10,20,10,20,25,30,25]
s3=["Delhi","Tamilnadu","Telangana","Delhi","Maharashtra","Tamilnadu","Telangana"]

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame({"City":s1,"Temp":s2,"State":s3})

In [4]:
from sklearn import preprocessing

In [5]:
s_scaler = preprocessing.StandardScaler()

In [6]:
mm_scaler=preprocessing.MinMaxScaler()

In [9]:
df_t =pd.DataFrame({"Temp": df["Temp"]})

In [10]:
t_s_scaled = s_scaler.fit_transform(df_t)

In [11]:
t_s_scaled

array([[-1.41421356],
       [ 0.        ],
       [-1.41421356],
       [ 0.        ],
       [ 0.70710678],
       [ 1.41421356],
       [ 0.70710678]])

In [12]:
mm_s_scaled = mm_scaler.fit_transform(df_t)

In [13]:
mm_s_scaled

array([[0.  ],
       [0.5 ],
       [0.  ],
       [0.5 ],
       [0.75],
       [1.  ],
       [0.75]])

In [21]:
pd.DataFrame(mm_s_scaled)

      0
0  0.00
1  0.50
2  0.00
3  0.50
4  0.75
5  1.00
6  0.75

In [16]:
df

      City  Temp        State
0    Delhi    10        Delhi
1  Chennai    20    Tamilnadu
2      Hyd    10    Telangana
3    Delhi    20        Delhi
4   Mumbai    25  Maharashtra
5  Chennai    30    Tamilnadu
6      Hyd    25    Telangana

In [24]:
df_mm=pd.concat([df[["City","State"]],pd.DataFrame(mm_s_scaled)],axis=1)

In [25]:
df_mm

      City        State     0
0    Delhi        Delhi  0.00
1  Chennai    Tamilnadu  0.50
2      Hyd    Telangana  0.00
3    Delhi        Delhi  0.50
4   Mumbai  Maharashtra  0.75
5  Chennai    Tamilnadu  1.00
6      Hyd    Telangana  0.75

In [28]:
df_mm.rename(columns={0:"Temp_mm"},inplace=True)

In [29]:
df_mm

      City        State  Temp_mm
0    Delhi        Delhi     0.00
1  Chennai    Tamilnadu     0.50
2      Hyd    Telangana     0.00
3    Delhi        Delhi     0.50
4   Mumbai  Maharashtra     0.75
5  Chennai    Tamilnadu     1.00
6      Hyd    Telangana     0.75

In [30]:
df_s=pd.concat([df[["City","State"]],pd.DataFrame(t_s_scaled)],axis=1)

In [31]:
df_s.rename(columns={0:"Temp_s"},inplace=True)

In [32]:
df_s

      City        State    Temp_s
0    Delhi        Delhi -1.414214
1  Chennai    Tamilnadu  0.000000
2      Hyd    Telangana -1.414214
3    Delhi        Delhi  0.000000
4   Mumbai  Maharashtra  0.707107
5  Chennai    Tamilnadu  1.414214
6      Hyd    Telangana  0.707107